billing_cf/Documents/бестУстановитьФормулуРасчетаТочекУчетаНП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>бестУстановитьФормулуРасчетаТочекУчетаНП</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.бестУровниВложенностиРасчетныхСхем</xr:Item>
				<xr:Item>InformationRegister.бестФормулыРасчетаТочекУчетаНП</xr:Item>
				<xr:Item>InformationRegister.бестРасчетныеСпособыТочекУчетаНП</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бестВидыОпераций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДолеваяТочкаУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргТочкиУчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргВидыУслуг</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.энргОперацияСУслугами</v8:Type>
						<v8:Type>cfg:DocumentRef.энргОперацияСЛицевымСчетом</v8:Type>
						<v8:Type>cfg:DocumentRef.энргОперацияСПриборомУчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресОбъекта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>160</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаФактическогоСобытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Примечание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособРаспределения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.энргСпособыРаспределенияОбъема</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъектРасчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бестОбъектыРасчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчитыватьИндивидуальноеПотребление</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнаяСхема</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.бестУстановитьФормулуРасчетаТочекУчетаНП</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТочкиУчета</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Договор</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргАбоненты</v8:Type>
								<v8:Type>cfg:CatalogRef.энргДоговорыКонтрагентов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОбъектРасчета</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бестОбъектыРасчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТочкаУчета</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргТочкиУчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Коэффициент</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Услуга</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргВидыУслуг</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Поставщик</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргКонтрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПриборУчета</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргПриборыУчетаАбонента</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СпособРаспределения</Name>
							<Type>
								<v8:Type>cfg:EnumRef.бестСпособыРаспределенияДолевыхСхем</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СпособРаспределенияОстатка</Name>
							<Type>
								<v8:Type>cfg:EnumRef.бестСпособыРаспределенияДолевыхСхем</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СпособРасчетаПриВыходеПУ</Name>
							<Type>
								<v8:Type>cfg:EnumRef.бестСпособыРаспределенияДолевыхСхем</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УчитыватьИндивидуальноеПотребление</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоэффициентДолевогоРаспределения</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СторнироватьОбъемИндивидуальногоПотребления</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФиксированныйОбъем</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>6</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоговорнойКоэффициент</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СхемаПриВыводеПодчиненногоПУ</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Договор</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргДоговорыКонтрагентов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОбъектРасчета</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бестОбъектыРасчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТочкаУчета</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргТочкиУчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Коэффициент</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Услуга</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргВидыУслуг</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Поставщик</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргКонтрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПриборУчета</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргПриборыУчетаАбонента</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СпособРаспределения</Name>
							<Type>
								<v8:Type>cfg:EnumRef.бестСпособыРаспределенияДолевыхСхем</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СпособРаспределенияОстатка</Name>
							<Type>
								<v8:Type>cfg:EnumRef.бестСпособыРаспределенияДолевыхСхем</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СпособРасчетаПриВыходеПУ</Name>
							<Type>
								<v8:Type>cfg:EnumRef.бестСпособыРаспределенияДолевыхСхем</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УчитыватьИндивидуальноеПотребление</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоэффициентДолевогоРаспределения</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СторнироватьОбъемИндивидуальногоПотребления</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

billing_cf/Enums/бестСпособыРаспределенияДолевыхСхем.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>бестСпособыРаспределенияДолевыхСхем</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ДолевоеРаспределение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Остаток</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПропорциональноПлощади</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПропорциональноНагрузке</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПропорциональноДоговорномуОбъему</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПропорциональноНачисленномуОбъему</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПропорциональноОбъемуНачисленнойУслуги</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПропорциональноРассчитанномуОбъему</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФиксированныйОбъем</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

billing_cf/Documents/бестУстановитьФормулуРасчетаТочекУчетаНП/Forms/ФормаДокументаНачислениеПоФормуле/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
		
	Если ЗначениеЗаполнено(Объект.Организация) Тогда
		Если не ЗначениеЗаполнено(Объект.ПериодНачисления) Тогда
			ЗаполнитьПериодНачисленияСервер();
		КонецЕсли;
	КонецЕсли;
	
	Если Параметры.Свойство("ЗаполнитьДокумент") тогда
		Если Параметры.ЗаполнитьДокумент тогда
			Объект.ТочкиУчета.Очистить();
			ЗаполнитьТочкиУчетаПоУмолчанию();
		КонецЕсли;		
	КонецЕсли;
	
	// ВводНаОсновании
	ВводНаОсновании.ПриСозданииНаСервере(ЭтотОбъект, Элементы.ПодменюСоздатьНаОсновании);
	// Конец ВводНаОсновании

	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПараметрыРазмещения = ПодключаемыеКоманды.ПараметрыРазмещения();
	ПараметрыРазмещения.КоманднаяПанель = Элементы.ПодменюОтчеты;
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект, ПараметрыРазмещения);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	Если ЗначениеЗаполнено(Объект.ДолеваяТочкаУчета) Тогда
		ЗаполнитьПриборУчетаПоУмолчанию();
	КонецЕсли;
	
	// Настройка доступности в зависимости от прав
	энргОбщегоНазначения.УстановитьДоступностьЭлементовПоРолям(ЭтаФорма, Новый Структура("ПриборУчета"), Метаданные.Документы.бестУстановитьФормулуРасчетаТочекУчетаНП);
	
	бестЛокализацияСервер.ПриСозданииНаСервере_бестУстановитьФормулуРасчетаТочекУчетаНП(ЭтотОбъект, Объект.Ссылка);
	
	ИспользоватьДанныеДляРасчетаЭлектроэнерииЮЛ = энргОбщегоНазначения.ЗначениеКонстанты("бестИспользоватьДанныеДляРасчетаЭлектроэнерииЮЛ");
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	// СтандартныеПодсистемы.ДатыЗапретаИзменения
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.ДатыЗапретаИзменения
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	ДопСвойства  = ТекущийОбъект.ДополнительныеСвойства;
	Если ДопСвойства.свойство("ДанныеДляПерерасчета") тогда
		ДанныеДляПерерасчета = ДопСвойства.ДанныеДляПерерасчета;		 
	иначе
		ДанныеДляПерерасчета = Неопределено;
	КонецЕсли;
	
	бестЛокализацияСервер.ПослеЗаписиНаСервере_бестУстановитьФормулуРасчетаТочекУчетаНП(ЭтотОбъект, Объект.Ссылка);
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	Если  ДанныеДляПерерасчета <>Неопределено тогда
		ОписаниеОповещения  = Новый ОписаниеОповещения("ВопросСозданияПерерасчета",ЭтотОбъект);
		ПоказатьВопрос(ОписаниеОповещения,"Открыть документ перерасчета?",РежимДиалогаВопрос.ДаНет);		
	КонецЕсли;
	ЗаполнитьПриборУчетаПоУмолчанию();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ЗаполнитьАдресОбъекта();
	НастроитьВидимость();
КонецПроцедуры


#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Объект.Организация) Тогда 		
		ЗаполнитьПериодНачисленияСервер(); 		
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура РассчитываемаяТочкаУчетаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ВыборУслугиИТочкиУчета(Новый Структура, Элемент);
КонецПроцедуры

&НаКлиенте
Процедура РассчитываемаяТочкаУчетаПриИзменении(Элемент)
	ЗаполнитьПриборУчетаПоУмолчанию();
	ЗаполнитьТочкиУчетаПоУмолчанию();
КонецПроцедуры

&НаКлиенте
Процедура ОбъектРасчетаПриИзменении(Элемент)
	ЗаполнитьАдресОбъекта();
	Объект.ДолеваяТочкаУчета = Неопределено;
	Объект.Услуга = Неопределено;
КонецПроцедуры

&НаКлиенте
Процедура УслугаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ВыборУслугиИТочкиУчета(Новый Структура, Элемент);
КонецПроцедуры

&НаКлиенте
Процедура ВидОперацииПриИзменении(Элемент)
	бестРаботаСВидамиОперацийКлиент.ПриИзмененииВидаОперации("бестУстановитьФормулуРасчетаТочекУчетаНП",Объект,Параметры.Ключ);
	Модифицированность = Ложь;
	ЭтаФорма.Закрыть();
КонецПроцедуры

&НаСервере
Процедура ДоговорПриИзмененииНаСервере()
	Объект.Район = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Договор,"Район")
КонецПроцедуры

&НаКлиенте
Процедура ДоговорПриИзменении(Элемент)
	ДоговорПриИзмененииНаСервере();
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТочкиУчета

&НаКлиенте
Процедура ТочкиУчетаДоговорНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	Если Не ИспользоватьДанныеДляРасчетаЭлектроэнерииЮЛ Тогда	
		СтандартнаяОбработка = Ложь;
		ТекДанные = Элемент.Родитель.ТекущиеДанные;
		ОписаниеОповещения 		= Новый ОписаниеОповещения("ДоговорОкончаниеВыбора", ЭтотОбъект, Новый Структура("ТекДанные", ТекДанные));
		ОткрытьФорму("Справочник.энргДоговорыКонтрагентов.ФормаВыбора",, ЭтотОбъект, , , , ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаОбъектРасчетаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ТекДанные = Элемент.Родитель.ТекущиеДанные;
	Если ТипЗнч(ТекДанные.Договор) = Тип("СправочникСсылка.энргДоговорыКонтрагентов") Тогда
		СтандартнаяОбработка = Ложь;
		
		ОписаниеОповещения 		= Новый ОписаниеОповещения("ОбъектРасчетаОкончаниеВыбора", ЭтотОбъект, Новый Структура("ТекДанные", ТекДанные));
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Организация", Объект.Организация);
		ПараметрыФормы.Вставить("Район", Объект.Район);
		ПараметрыФормы.Вставить("Договор", ТекДанные.Договор);
		ПараметрыФормы.Вставить("Период", Объект.Дата);
		
		ОткрытьФорму("Справочник.бестОбъектыРасчета.ФормаВыбора", ПараметрыФормы, ЭтотОбъект, , , , ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаТочкаУчетаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ТекДанные = Элемент.Родитель.ТекущиеДанные;   
	Если ТипЗнч(ТекДанные.Договор) = Тип("СправочникСсылка.энргДоговорыКонтрагентов") Тогда	
		ВыборУслугиИТочкиУчета(ТекДанные, Элемент);
	ИначеЕсли ТипЗнч(ТекДанные.Договор) = Тип("СправочникСсылка.энргАбоненты") Тогда
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Организация", Объект.Организация);
		ПараметрыФормы.Вставить("Район", Объект.Район);
		ПараметрыФормы.Вставить("АбонентВладелец", энргОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТекДанные.Договор, "КлючПомещения"));
		ПараметрыФормы.Вставить("Период", Объект.Дата);
		
		ОткрытьФорму("Справочник.энргТочкиУчета.ФормаВыбора", ПараметрыФормы, Элемент);
	Иначе
		ОбщегоНазначенияКлиент.СообщитьПользователю("Поле не заполнено.",, "ТочкиУчетаДоговор");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаУслугаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ТекДанные = Элемент.Родитель.ТекущиеДанные;   
	Если ТипЗнч(ТекДанные.Договор) = Тип("СправочникСсылка.энргДоговорыКонтрагентов") Тогда	
		ВыборУслугиИТочкиУчета(ТекДанные, Элемент);
	ИначеЕсли ТипЗнч(ТекДанные.Договор) = Тип("СправочникСсылка.энргАбоненты") Тогда
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Организация", Объект.Организация);
		ПараметрыФормы.Вставить("Район", Объект.Район);
		ПараметрыФормы.Вставить("КлючПомещения", энргОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТекДанные.Договор, "КлючПомещения"));
		ПараметрыФормы.Вставить("Период", Объект.Дата);
		ПараметрыФормы.Вставить("ТочкаУчета", ТекДанные.ТочкаУчета);
		
		ОткрытьФорму("Справочник.энргВидыУслуг.ФормаВыбора", ПараметрыФормы, Элемент);
	Иначе
		ОбщегоНазначенияКлиент.СообщитьПользователю("Поле не заполнено.",, "ТочкиУчетаУслуга");
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТочкиУчетаПриВыводеПУ

&НаКлиенте
Процедура ТочкиУчетаПриВыводеПУОбъектРасчетаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ТекСтрока = Элементы.ТочкиУчетаПриВыводеПУ.ТекущиеДанные;
	Если ТекСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// ВводНаОсновании
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуСоздатьНаОсновании(Команда)
	
	ВводНаОснованииКлиент.ВыполнитьПодключаемуюКомандуСоздатьНаОсновании(Команда, ЭтотОбъект, Объект);
	
КонецПроцедуры
// Конец ВводНаОсновании

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	МодульПодключаемыеКомандыКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("ПодключаемыеКомандыКлиент");
	МодульПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат)
	МодульПодключаемыеКоманды = ОбщегоНазначения.ОбщийМодуль("ПодключаемыеКоманды");
	МодульПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	МодульПодключаемыеКомандыКлиентСервер = ОбщегоНазначенияКлиент.ОбщийМодуль("ПодключаемыеКомандыКлиентСервер");
	МодульПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры

// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

&НаКлиенте
Процедура ЗаполнитьПоСтруктуреСети(Команда)
	ЗаполнитьПоСтруктуреСетиНаСервере();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьПериодНачисленияСервер()
	Объект.ПериодНачисления = Обработки.бестГраницыПериодаНачисленияМенеджер.ОпределитьПериодНачисления(Объект.Дата, Объект.Организация,Объект.Район);	
КонецПроцедуры

&НаКлиенте
Процедура ВопросСозданияПерерасчета(РезультатВопроса,ДополнительныеПараметры) Экспорт 
	Если ТипЗнч(РезультатВопроса) = Тип("КодВозвратаДиалога") тогда		
		Если  РезультатВопроса = КодВозвратаДиалога.Да тогда
			энргРаботаСПериодомДействияКлиент.ОткрытьФормуДокументаПерерасчет(ДанныеДляПерерасчета);
		иначе
			ДанныеДляПерерасчета = Неопределено;
		КонецЕсли; 		
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТочкиУчетаПоУмолчанию()

	Объект.ТочкиУчета.Очистить();
	АктивныеТочки				= энргРаботаСТочкамиУчетаСервер.ДействующиеТочкиУчета(Объект.Дата,Объект.Район,, Объект.ОбъектРасчета);
	
	Запрос  					= Новый Запрос;
	Запрос.УстановитьПараметр("АктивныеТочки",					АктивныеТочки);
	Запрос.УстановитьПараметр("РассчитываемаяТочкаУчета" ,		Объект.ДолеваяТочкаУчета);
	Запрос.Текст 				=
	"ВЫБРАТЬ
	|	АктивныеТочки.ТочкаУчета КАК ТочкаУчета
	|ПОМЕСТИТЬ АктивныеТочки
	|ИЗ
	|	&АктивныеТочки КАК АктивныеТочки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	АктивныеТочки.ТочкаУчета КАК ТочкаУчета
	|ИЗ
	|	АктивныеТочки КАК АктивныеТочки
	|ГДЕ
	|	АктивныеТочки.ТочкаУчета <> &РассчитываемаяТочкаУчета";
	
	Результат  	= Запрос.Выполнить();
	Выборка  	= Результат.Выбрать();
	
	Пока Выборка.Следующий() цикл
		СтрокаТЧ  		       = Объект.ТочкиУчета.Добавить();
		СтрокаТЧ.ТочкаУчета    =  Выборка.ТочкаУчета; 
		СтрокаТЧ.ОбъектРасчета = Объект.ОбъектРасчета; 
		Если ИспользоватьДанныеДляРасчетаЭлектроэнерииЮЛ Тогда 
			СтрокаТЧ.СпособРаспределения = Перечисления.бестСпособыРаспределенияДолевыхСхем.Остаток;
		КонецЕсли;
	КонецЦикла;   
	 
КонецПроцедуры 

&НаСервере
Процедура ЗаполнитьПриборУчетаПоУмолчанию()
	ПриборУчета = бестРаботаСПриборамиУчетаСервер.ПолучитьПриборУчетаПоТочке(?(ЗначениеЗаполнено(Объект.ДатаФактическогоСобытия),КонецДня(Объект.ДатаФактическогоСобытия),Объект.Дата), Объект.Организация, Объект.Район, Объект.ОбъектРасчета, Объект.ДолеваяТочкаУчета); 
КонецПроцедуры

&НаКлиенте
Процедура ВыборУслугиИТочкиУчета(ТекДанные, Элемент)
	СтруктураОтбора = Новый Структура("Период,Организация,Район,ОбъектРасчета",КонецДня(Объект.ДатаФактическогоСобытия));
	ЗаполнитьЗначенияСвойств(СтруктураОтбора,Объект);
	ЗаполнитьЗначенияСвойств(СтруктураОтбора,ТекДанные);
	СтруктураОтбора.Период = ?(ЗначениеЗаполнено(Объект.ДатаФактическогоСобытия), КонецДня(Объект.ДатаФактическогоСобытия), КонецДня(Объект.Дата));
	
	Если ТипЗнч(ТекДанные) = Тип("Структура") Тогда
		СтруктураОтбора.ОбъектРасчета = Объект.ОбъектРасчета;
	Иначе
		СтруктураОтбора.ОбъектРасчета = ТекДанные.ОбъектРасчета;
	КонецЕсли;

	ПараметрыВыбораФормы	= Новый Структура("СтруктураОтбора,ТипВладельца", СтруктураОтбора, "НП");
	ОписаниеОповещения 		= Новый ОписаниеОповещения("ТочкаУчетаОкончаниеВыбора",ЭтаФорма,Новый Структура("ТекДанные", ТекДанные));
	
	ОткрытьФорму("ОбщаяФорма.бестФормаВыбораТочкиУчета",ПараметрыВыбораФормы, ЭтаФорма,,,,ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
КонецПроцедуры

&НаКлиенте
Процедура ТочкаУчетаОкончаниеВыбора(РезультатЗакрытия,ДополнительныеПараметры) Экспорт  
	
	Если РезультатЗакрытия <> Неопределено Тогда 
		Модифицированность	= Истина;
		ТекДанные			= ДополнительныеПараметры.ТекДанные;
		
		Если ТипЗнч(ТекДанные) = Тип("Структура") Тогда
			Объект.ДолеваяТочкаУчета = РезультатЗакрытия.ТочкаУчета;
			Объект.Услуга 			= РезультатЗакрытия.Услуга;
			ЗаполнитьПриборУчетаПоУмолчанию();

			НовСтр 					= Объект.ТочкиУчета.Добавить();
			НовСтр.ОбъектРасчета 	= Объект.ОбъектРасчета;
			НовСтр.ТочкаУчета 		= РезультатЗакрытия.ТочкаУчета;
			НовСтр.Услуга 			= РезультатЗакрытия.Услуга;
			НовСтр.Договор 			= Объект.Договор; 
			Если ИспользоватьДанныеДляРасчетаЭлектроэнерииЮЛ Тогда 
				НовСтр.СпособРаспределения = ПредопределенноеЗначение("Перечисление.бестСпособыРаспределенияДолевыхСхем.Остаток");
			КонецЕсли;

		Иначе
			ТекДанные.ТочкаУчета = РезультатЗакрытия.ТочкаУчета;
			ТекДанные.Услуга = РезультатЗакрытия.Услуга;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПоСтруктуреСетиНаСервере()
	ДанныеПоСтруктуре = Документы.бестУстановитьФормулуРасчетаТочекУчетаНП.ПолучитьДанныеСтруктурыСетиПоТочке(Объект.ДолеваяТочкаУчета,Объект.Услуга,Объект.ОбъектРасчета,Объект.Район,Объект.Организация,Объект.Дата);
	
	Если ДанныеПоСтруктуре <> Неопределено Тогда
		ВыборкаДетальныеЗаписи = ДанныеПоСтруктуре.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			НовСтр = Объект.ТочкиУчета.Добавить();
			ЗаполнитьЗначенияСвойств(НовСтр,ВыборкаДетальныеЗаписи); 
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьАдресОбъекта()
	Если ЗначениеЗаполнено(Объект.ОбъектРасчета) Тогда
		АдресОбъекта = бестРаботаСОбъектамиНПВызовСервера.ВернутьАдресОбъектаРасчета(Объект.ОбъектРасчета);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура НастроитьВидимость()
	Если ИспользоватьДанныеДляРасчетаЭлектроэнерииЮЛ Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ТочкиУчетаДоговор", "Заголовок", "Договор/Абонент");
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СтраницаСхемаПриВыводеПУ", "Видимость", Ложь); 
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ТочкиУчетаГруппаВода", "Видимость", Ложь); 
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ТочкиУчетаЗаполнитьПоСтруктуреСети", "Видимость", Ложь);
	КонецЕсли;
 КонецПроцедуры

&НаКлиенте
Процедура ДоговорОкончаниеВыбора(РезультатЗакрытия, ДополнительныеПараметры) Экспорт  
	
	Если Не РезультатЗакрытия = Неопределено Тогда 
		Модифицированность = Истина;
		ТекДанные = ДополнительныеПараметры.ТекДанные;
		ТекДанные.Договор = РезультатЗакрытия;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбъектРасчетаОкончаниеВыбора(РезультатЗакрытия, ДополнительныеПараметры) Экспорт  
	
	Если Не РезультатЗакрытия = Неопределено Тогда 
		Модифицированность = Истина;
		ТекДанные = ДополнительныеПараметры.ТекДанные;
		ТекДанные.ОбъектРасчета = РезультатЗакрытия;
	КонецЕсли;
	
КонецПроцедуры


#КонецОбласти
